# Петя и Катя – брат и сестра. Петя – студент, а Катя – школьница. Петя помогает Кате по математике.
# Он задумывает два натуральных числа X и Y (X,Y≤1000), а Катя должна их отгадать. 
# Для этого Петя делает две подсказки. Он называет сумму этих чисел S и их произведение P.
# Помогите Кате отгадать задуманные Петей числа.

x, y = input('Введите два число: ').split()
x, y = int(x), int(y)

if x <= 1000 and y <= 1000:
    print('Сумма двух чисел:',x + y,' Призведения:', x * y)
    for i in range()
    else: print('Ответ верный! молодец!')

#!!!!!!!!!Сделана не правильно смотреть в папке семинар!!!!